{
    "skills": "Compétences",
    "projects": "Projets",
    "contact": "Contact",
    "about": "À propos",
    "aboutPresentation": "Bonjour, je suis Julien",
    "aboutTitle": "Ingénieur Logiciel & Développeur",
    "aboutDescBefore" : "Je suis un développeur passionné par le code depuis ma première tentative. Étudier à",
    "aboutLink": "l’école 42",
    "aboutDescAfter": "m’a permis de développer une compréhension approfondie et flexible de la programmation en utilisant des langages bas‑niveau.\n\nJe suis particulièrement attiré par le développement de jeux et l’automatisation des processus robotiques, mais je ne me limite pas à ces domaines. Je suis constamment en train d'apprendre de nouvelles choses, ce qui m’a conduit à utiliser plusieurs langages de programmation, outils logiciels et méthodes de travail créatives.",
    "hobbiesTitle": "Mes loisirs sont :",
    "hobbiesDesc": "Développement personnel de jeux, Piano, Jeux vidéo, Escalade",
    "downloadResume": "Télécharger mon CV",

    "about42Presentation" : "L'école 42",
    "about42Title" : "Apprendre à apprendre, une école peer to peer",
    "about42DescBefore": "42 est une école de développement peer‑to‑peer, axée sur des projets, sans enseignants, reconnue internationalement dans l’industrie tech. L’admission requiert de réussir un examen sélectif et intensif d’un mois (« piscine »), sept jours sur sept.\n\nUne fois admis, il faut tout coder en pure C, sans bibliothèques ni fonctions externes, ce qui vous oblige à maîtriser les fondamentaux sans recourir à une aide extérieure. L’école impose des règles strictes : respecter la Norme, proscrire les fonctions externes et garantir zéro fuite mémoire ni plantage. Chaque projet est évalué par vos pairs, vous apprenez à analyser le code des autres, à en identifier les limites et à défendre vos propres solutions, souvent malgré les barrières linguistiques.\n\nLa mission de 42 est d’enseigner les fondamentaux et la rigueur via des projets, afin de permettre aux étudiants d’apprendre n’importe quelle technologie ou langage dans un univers tech en constante évolution.\n\nEn résumé, 42 m’a enseigné la collaboration, la résilience, un développement propre et efficace, et l’adaptabilité nécessaire pour relever des projets variés et exigeants. Au‑delà de tout, j’ai appris à apprendre, un élément essentiel de",
    "about42Link": "mon parcours de développeur",
      

    "technologyUsed" : "Technologies utilisées",
    "schoolProject" : "Projet d'étude",
    "personalProject" : "Projet Personnel",
    "memoryManagement" : "Gestion de la mémoire",
    "algorithm" : "Algorithme",
    "sorting" : "Tri",
    "fileModification": "Modification de fichiers",
    "memoryModification": "Modification de mémoire",
    "reverseEngineering": "Rétro-Ingénierie",
    "multiThreading" : "Multi-Threading",
    "gameDeveloppement" : "Développement de jeux vidéos",
    "3DModeling" : "Modélisation 3D",
    "automation" : "Automatisation",
    "soundDesign" : "Design Audio",
    "gameDesign" : "Game Design",
    "teamManagement" : "Management d'équipe",
    "webDevelopment " : "Développement Web",
    "responsiveDesign" : "Design Responsive",
    "viewGithub" : "Voir sur Github",
    "math" : "Mathématiques",


    "programmingLanguages" : "Languages de programmation",
    "software" : "Logiciels",
    "other" : "Autre",
    "problemSolving" : "Résolution de problèmes",
    "teamWork" : "Travail d'équipe",
    "jobOpportunity": "Ouvert aux opportunités d'emploi",
  "jobOpportunityDesc": "Je suis ouvert à des postes en dévloppement. Qu'il s'agisse de temps partiel ou de temps plein, je suis prêt à relever de nouveaux défis et à développer mes compétences. Je recherche particulièrement des opportunités en automatisation des processus robotisés et en développement de jeux, mais je reste ouvert à tout autre domaine susceptible de m'intéresser.",
  "developSomething": "Ouvert aux collaborations",
  "developSomethingDesc": "Que vous lanciez un projet personnel ou une startup, je suis toujours enthousiaste à l'idée de collaborer sur des logiciels innovants, des outils ou des projets de développement de jeux.",
  "contractOpportunity": "Disponible pour missions freelance & contrats",
  "contractOpportunityDesc": "Besoin de support à court terme ou d'un contrat plus long ? Je peux intervenir pour vous aider à atteindre vos objectifs. Je suis ouvert aux missions freelance et aux contrats, n'hésitez pas à me contacter.",

"42SecondsDescription": "42 Seconds est le vainqueur de la Game Jam organisé lors de la convention LGX, sur le thème 42, et pour lequel nous avions une semaine pour le réaliser. Dans ce jeu, vous devez résoudre plusieurs énigmes en 42 secondes chacune. Le but était de créer un jeu accessible, simple à prendre en main avec peu de commandes pour toucher le plus large public.",
  "portfolioDesc": "Portfolio",
  "elementsKeeperDesc": "Elements Keeper est un jeu créé pour la Pirate Software Game Jam en 72 heures, dont le thème était « Shadow » et « Alchemy », et qui a été classé #1 pour la jouabilité. Tous les éléments du jeu, visuels, son et musique , ont été réalisés par nos soins. Le but du jeu est de combiner des éléments pour créer des tours afin de repousser des vagues d’ennemis.",
  "minishellDesc": "Minishell est un shell écrit en C qui reproduit le comportement de bash : gestion des codes de sortie, redirections, pipes, utilisation et exportation des arguments. En gros, tout ce que bash est capable de faire.",
  "pushSwapDesc": "Push Swap est un algorithme de tri qui n'utilise que des commandes prédéfinies telles que (RB : faire pivoter la pile B d'une position, PA : pousser le premier élément de la pile B en haut de la pile A, etc.) pour trier n'importe quelle liste de nombres. L'objectif est de trier la liste en utilisant le moins de mouvements possible.",
  "fordJohnsonDesc": "L'algorithme de Ford-Johnson (également appelé Merge-Insertion Sort) est reconnu comme l'un des algorithmes de tri les plus efficaces en nombre de comparaisons, notamment pour les ensembles de données de petite à moyenne taille. Il se base sur le couplement d'éléments et leur tri en petits groupes, puis l'insertion des plus petits éléments dans la liste triée à l'aide d'une recherche binaire fondée sur la suite de Jacobsthal.",
  "transcendenceDesc": "Transcendence était le dernier projet du cursus de l'école 42. C'est un site web full stack réalisé en groupe. L'objectif était de créer un site où les utilisateurs pouvaient créer des comptes pour jouer au jeu rétro Pong. Je me suis principalement occupé de tous les aspects du jeu, à savoir : backend du jeu, game design, visuels, système de particules, matchmaking, tournois, personnalisation du jeu, système de succès, et bien plus encore. J'ai également contribué au développement frontend du site de manière générale.",
  "hackathondesc": "Ce hackathon nous a demandé, en 78 heures, d'assembler un robot et de le programmer en C++ en utilisant des API fournies pour contrôler les moteurs et recevoir des données sur le jeu. L'objectif était de progresser dans un labyrinthe qui rétréci, de collecter et d'utiliser des bombes pour marquer des points et d'essayer d'éliminer les autres robots. Le matériel et le temps limités ont exigé une planification et des choix stratégiques. Nous avons terminé 8ᵉ sur 50.",
  "gameDesc": "",
  "eldenRingTwitchDesc": "Ce projet permet aux spectateurs Twitch d'interagir avec le jeu Elden Ring via des récompenses de points de chaîne personnalisées. Grâce à cette intégration, les spectateurs peuvent modifier, en mémoire, des statistiques du jeu telles que la vigueur, l'endurance, l'intelligence ou influencer la santé du joueur en échangeant des récompenses dans le chat Twitch. Ce projet a utilisé une combinaison de rétro‑ingénierie, de chatbot et de manipulation de la mémoire.",
  "eldenRingSaveDesc": "Ce projet est une application Windows Forms créée à la sortie d'Elden Ring pour aider les joueurs à gérer leurs fichiers de sauvegarde. L'application permet de sauvegarder, charger et supprimer facilement des fichiers de sauvegarde en temps réel dans un jeu qui ne le permet pas, ainsi que d'utiliser des fonctions mémoire pour forcer le chargement d'une sauvegarde. Cette application a été très populaire parmi les speedrunners.",
  "eldenRingDeathDesc": "Ce projet, réalisé à la sortie d'Elden Ring pour les streamers Twitch, permet d'afficher le nombre de morts. Il utilise l'OCR Tesseract pour détecter les décès plutôt que la mémoire, afin que le streamer n'ait pas besoin d'un logiciel d'anti-triche. Le programme se contente d'incrémenter un compteur de morts dans un fichier texte local.",
  "webservDesc": "L'objectif du projet est de construire un serveur web HTTP compatible C++98 à partir de zéro. Le serveur peut gérer les requêtes HTTP GET, HEAD, POST, PUT et DELETE, servir des fichiers statiques depuis un répertoire racine spécifié ou du contenu dynamique via CGI. Il est également capable de traiter plusieurs connexions clients simultanément et utilise un fichier de configuration de style nginx.",
  "cub3dDesc": "Cub3D est un moteur de jeu 3D simple en C, inspiré du classique Wolfenstein 3D. L'objectif est de rendre une carte 2D en perspective première personne 3D en utilisant des techniques de raycasting ; le but du jeu présenté est de trouver la sortie en explorant le labyrinthe avant que votre niveau d'oxygène ne s'épuise.",
  "philoDesc": "L'objectif du projet est d'implémenter le problème classique des Philosophes mangeurs (Dining Philosophers) en C en utilisant les threads POSIX et les sémaphores. Il simule N philosophes alternant entre réflexion et repas, et prévient les interblocages grâce à une stratégie de verrouillage asymétrique. Un exercice pour comprendre et mettre en œuvre la concurrence, la synchronisation et le partage de ressources dans un environnement multi‑threads.",

    "copyright": "Tous droits réservés"
}
